{
    "attention_probs_dropout_prob": 0.1,
    "coordinate_size": 96,
    "has_relative_attention_bias": true,
    "has_spatial_attention_bias": true,
    "hidden_act": "gelu",
    "hidden_dropout_prob": 0.1,
    "hidden_size": 768,
    "initializer_range": 0.02,
    "input_size": 224,
    "intermediate_size": 3072,
    "layer_norm_eps": 1e-05,
    "max_2d_position_embeddings": 1024,
    "max_position_embeddings": 514,
    "max_rel_2d_pos": 256,
    "max_rel_pos": 128,
    "model_type": "docmamba",
    "num_attention_heads": 12,
    "num_hidden_layers": 12,
    "pad_token_id": 1,
    "rel_2d_pos_bins": 64,
    "rel_pos_bins": 32,
    "second_input_size": 112,
    "shape_size": 128,
    "torch_dtype": "float32",
    "transformers_version": "4.41.0.dev0",
    "type_vocab_size": 1,
    "visual_embed": true,
    "text_embed": true,
    "vocab_size": 50265,
    "encoder_type": "bimamba",
    "mamba_pretrained_path": "/your_path_to_vanilla_mamba_checkpoint/mamba-130m-hf/",
    "text_use_position_embeddings": false,
    "image_use_position_embeddings": false,
    "layout_point_num": 8,
    "patch_size": 16,
    "num_channels": 3
}